app/controllers/books_controller.rb

    def index
        @book = Book.new
        @books = Book.all.order("id desc")
---
SELECT "books".* FROM "books" ORDER BY id desc

    def show
        @book = Book.find(params[:id])
        @new_book = Book.new
        @user = User.find(@book.user_id)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def create
        @book = Book.new(book_params)
        @book.user_id = current_user.id
        if @book.save
            flash[:notice] = "Book was successfully created."
            redirect_to(book_path(@book))
        else
            @new_book = Book.new
            @books = Book.all.order("id desc")
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "notice"], ["body", "test"], ["created_at", "2020-01-20 06:02:29.530978"], ["updated_at", "2020-01-20 06:02:29.530978"], ["user_id", 2]]
SELECT "books".* FROM "books" ORDER BY id desc